const ForBusiness = () => {
  const proseSetting: string =
    "prose py-12 text-black prose-h1:text-black prose-h2:text-black prose-a:text-blue-500 prose-strong:text-blue-500 prose-strong:font-bold prose-h2:border-b-2  prose-h2:text-3xl";

  return (
    <main className="flex min-h-screen flex-col items-center justify-between py-12">
      <div className={proseSetting}>
        <h2 id="%E3%83%93%E3%82%B8%E3%83%8D%E3%82%B9%E3%83%BB%E5%9B%A3%E4%BD%93%E3%81%A7%E3%81%AE%E6%B4%BB%E7%94%A8%E6%B3%95">
          ビジネス・団体での活用法
        </h2>
        <p>
          Evekiはビジネス・団体においてもそれに応じた活用を行うことができます。例えば企業のイメージキャラクターを再現したAIを作成し、サービスの利用者などと会話させることで広報としての役割を与えることができます。
        </p>
        <h2 id="%E5%BE%93%E6%9D%A5%E3%81%AE%E5%85%AC%E5%BC%8F%E3%82%A2%E3%82%AB%E3%82%A6%E3%83%B3%E3%83%88%E3%81%A8%E3%81%AE%E9%81%95%E3%81%84">
          従来の公式アカウントとの違い
        </h2>
        <p>
          従来よく使用されていた公式アカウントなどと異なる大きな点は親密さです。SNSなどで活用されている公式アカウントでは主に告知が中心であり、加えて担当者の個人的な反応も少し行うというのが一般的な運用方法です。一方的な宣伝と異なり、親しみや信頼を感じられる相互的なコミュニケーションが取れることがメリットだとされています。
        </p>
        <p>
          ただしこの効果を得るための運用は簡単ではありません。告知ばかりになれば意味がありませんが、個人的な意見には思わぬ反応や誤解が起き、かえってブランドイメージを損なうような結果になるリスクがあります。
        </p>
        <p>
          AIならば人間が運用する際に起きる不適切な発言やブランドイメージを損なう言動はあらかじめ対策することができます。またユーザーひとりひとりと確実にコミュニケーションを取ることができるためより個人的な信頼を得られやすいとも言えます。
        </p>
        <h2 id="%E7%B4%A0%E6%97%A9%E3%81%84%E5%B1%95%E9%96%8B%E3%81%8C%E5%8F%AF%E8%83%BD">
          素早い展開が可能
        </h2>
        <p>
          時間帯や言語に関わらず対応できるのも強みです。AIは24時間稼働させることができるだけではなく、主要な言語なら日本語以外でも扱うことができます。海外展開を行うとき、その言語を扱える部門を本格的に設立する必要なく広報活動を開始することが可能です。
        </p>
        <p>
          iOS版『Eveki』にはAIをQRコードで送受信する機能が搭載されています。これを活用すればビジネス・団体に所属するAIを簡単に普及させることができます。アプリとQRコードのみで完結しているため、印刷物に掲載してイベントで配布するなどといった使い方もできます。
        </p>
        <h2 id="%E5%88%A9%E7%94%A8%E3%81%AE%E3%81%8A%E7%94%B3%E3%81%97%E8%BE%BC%E3%81%BF">
          利用のお申し込み
        </h2>
        <p>
          現在APIなど他サービスとの連携を行う機能は一般公開しておりません。しかし本格的な運用を視野に入れて開発しており、すでに公式LINEなどでの活用は実装しております。もしご興味のある方は以下のフォームからお知らせください。ご要望に合わせて製品の説明をさせていただきます。
        </p>
      </div>
    </main>
  );
};

export default ForBusiness;
